particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
int BleObject::ConnectionsManager::disconnect(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(fetchConnection(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    int ret = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    disconnectingHandle_ = connHandle;
    if (os_semaphore_take(disconnectSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::disconnectAll() {
    for (const auto& connection : connections_) {
        // TODO: check the return value.
        disconnect(connection.info.conn_handle);
        // The corresponding connection in the Vector will be removed on the disconnected event.
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::updateConnectionParams(hal_ble_conn_handle_t connHandle, const hal_ble_conn_params_t* params) {
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
        centralConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    if (connection->info.role == BLE_ROLE_PERIPHERAL) {
        // If the automatic peripheral connection parameters update procedure is started.
        if (os_timer_is_active(connParamsUpdateTimer_, nullptr)) {
            periphConnParamUpdateHandle_ = BLE_INVALID_CONN_HANDLE;
            connParamsUpdateAttempts_ = 0;
            os_timer_change(connParamsUpdateTimer_, OS_TIMER_CHANGE_STOP, HAL_IsISR() ? true : false, 0, 0, nullptr);
        }
    }
    ble_gap_conn_params_t bleGapConnParams = {};
    if (params == nullptr) {
        // Use the PPCP characteristic value as the connection parameters.
        int ret = sd_ble_gap_ppcp_get(&bleGapConnParams);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    } else {
        bleGapConnParams = toPlatformConnParams(params);
    }
    if (connection->info.role == BLE_ROLE_PERIPHERAL) {
        periphConnParamUpdateHandle_ = connHandle;
    } else {
        centralConnParamUpdateHandle_ = connHandle;
    }
    // For Central role, this will initiate the connection parameter update procedure.
    // For Peripheral role, this will use the passed in parameters and send the request to central.
    int ret = sd_ble_gap_conn_param_update(connHandle, &bleGapConnParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    if (os_semaphore_take(connParamsUpdateSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::getConnectionInfo(hal_ble_conn_handle_t connHandle, hal_ble_conn_info_t* info) {
    const BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    memcpy(info, &connection->info, std::min(connection->info.size, connection->info.size));
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::initSecParams(const hal_ble_pairing_config_t& config, ble_gap_sec_params_t& secParams) {
    if (config.io_caps == BLE_IO_CAPS_NONE) {
        secParams.mitm = false;
    } else {
        secParams.mitm = true;
    }
    if (config.algorithm == BLE_PAIRING_ALGORITHM_LEGACY_ONLY) {
        secParams.lesc = false;
    } else {
        secParams.lesc = true;
    }
    secParams.io_caps        = toPlatformIoCaps(config.io_caps);
    secParams.keypress       = false;
    secParams.bond           = false;
    secParams.oob            = false;
    secParams.min_key_size   = BLE_ENC_MIN_KEY_SIZE;
    secParams.max_key_size   = BLE_ENC_MAX_KEY_SIZE;
    secParams.kdist_own.enc  = true;
    secParams.kdist_own.id   = true;
    secParams.kdist_peer.enc = true;
    secParams.kdist_peer.id  = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::generateEcdhKeyPair(void) {
    ecdhContextInit_ = false;
    mbedtls_ecdh_init(&ecdhContext_);
    CHECK_MBEDTLS(mbedtls_ecdh_setup(&ecdhContext_, MBEDTLS_ECP_DP_SECP256R1));
    CHECK_MBEDTLS(mbedtls_ecdh_gen_public(&ecdhContext_.ctx.mbed_ecdh.grp, &ecdhContext_.ctx.mbed_ecdh.d,
            &ecdhContext_.ctx.mbed_ecdh.Q, mbedtls_default_rng, nullptr));
    ecdhContextInit_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::publicKeysPrepare(BleConnection* connection) {
    if (!ecdhContextInit_) {
        generateEcdhKeyPair();
    }
    CHECK_TRUE(ecdhContextInit_, SYSTEM_ERROR_INVALID_STATE);
    // Local public key: won't be freed.
    if (!localPublicKey_) {
        localPublicKey_ = std::make_unique<ble_gap_lesc_p256_pk_t>();
        CHECK_TRUE(localPublicKey_, SYSTEM_ERROR_NO_MEMORY);
    }
    const uint8_t pointLen = BLE_GAP_LESC_P256_PK_LEN / 2;
    CHECK_MBEDTLS(mbedtls_mpi_write_binary_le(&ecdhContext_.ctx.mbed_ecdh.Q.X, &(localPublicKey_.get()->pk[0]), pointLen));
    CHECK_MBEDTLS(mbedtls_mpi_write_binary_le(&ecdhContext_.ctx.mbed_ecdh.Q.Y, &(localPublicKey_.get()->pk[pointLen]), pointLen));
    // Peer public key: will be freed on authentication status updated or disconnected.
    connection->peerPublicKey = std::make_unique<ble_gap_lesc_p256_pk_t>();
    CHECK_TRUE(connection->peerPublicKey, SYSTEM_ERROR_NO_MEMORY);
    memset(connection->peerPublicKey.get(), 0x00, BLE_GAP_LESC_P256_PK_LEN);
    return SYSTEM_ERROR_NONE;
}

int BleObject::ConnectionsManager::computeDhkey(const uint8_t peerPublicKey[BLE_GAP_LESC_P256_PK_LEN], uint8_t dhKey[BLE_GAP_LESC_DHKEY_LEN]) {
    CHECK_TRUE(ecdhContextInit_, SYSTEM_ERROR_INVALID_STATE);
    const uint8_t pointLen = BLE_GAP_LESC_P256_PK_LEN / 2;
    CHECK_MBEDTLS(mbedtls_mpi_read_binary_le(&ecdhContext_.ctx.mbed_ecdh.Qp.X, &peerPublicKey[0], pointLen));
    CHECK_MBEDTLS(mbedtls_mpi_read_binary_le(&ecdhContext_.ctx.mbed_ecdh.Qp.Y, &peerPublicKey[pointLen], pointLen));
    CHECK_MBEDTLS(mbedtls_mpi_lset(&ecdhContext_.ctx.mbed_ecdh.Qp.Z, 1));
    CHECK_MBEDTLS(mbedtls_ecdh_compute_shared(&ecdhContext_.ctx.mbed_ecdh.grp, &ecdhContext_.ctx.mbed_ecdh.z, 
            &ecdhContext_.ctx.mbed_ecdh.Qp, &ecdhContext_.ctx.mbed_ecdh.d, mbedtls_default_rng, nullptr));
    CHECK_MBEDTLS(mbedtls_mpi_write_binary_le(&ecdhContext_.ctx.mbed_ecdh.z, dhKey, BLE_GAP_LESC_DHKEY_LEN));
    return SYSTEM_ERROR_NONE;
}

