particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
void BleObject::ConnectionsManager::processConnectionEvents(const ble_evt_t* event, void* context) {
    ConnectionsManager* connMgr = static_cast<ConnectionsManagerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_CONNECTED: {
            LOG_DEBUG(TRACE, "BLE GAP event: connected.");
            const ble_gap_evt_connected_t& connected = event->evt.gap_evt.params.connected;
            ble_evt_t* connectedEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t));
            if (!connectedEvent) {
                LOG(ERROR, "Allocate memory for BLE event failed. Disconnect from peer.");
                sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                hal_ble_addr_t address = toHalAddress(connected.peer_addr);
                if (connMgr->isConnecting_ && connected.role == BLE_GAP_ROLE_CENTRAL && addressEqual(address, connMgr->connectingAddr_)) {
                    connMgr->isConnecting_ = false;
                    os_semaphore_give(connMgr->connectSemaphore_, false);
                }
                break;
            }
            memcpy(connectedEvent, event, sizeof(ble_evt_t));
            BleObject::getInstance().dispatcher()->enqueue(&connectedEvent);
            break;
        }
        case BLE_GAP_EVT_DISCONNECTED: {
            LOG_DEBUG(TRACE, "BLE GAP event: disconnected.");
            BleObject::getInstance().dispatcher()->enqueue(event);
            break;
        }
        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter update request.");
            int ret = sd_ble_gap_conn_param_update(event->evt.gap_evt.conn_handle, &event->evt.gap_evt.params.conn_param_update_request.conn_params);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
            }
            break;
        }
        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameters updated.");
            BleObject::getInstance().dispatcher()->enqueue(event);
            break;
        }
        case BLE_GAP_EVT_SEC_INFO_REQUEST:
        case BLE_GAP_EVT_LESC_DHKEY_REQUEST:
        case BLE_GAP_EVT_PASSKEY_DISPLAY:
        case BLE_GAP_EVT_AUTH_KEY_REQUEST:
        case BLE_GAP_EVT_SEC_REQUEST:
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        case BLE_GAP_EVT_CONN_SEC_UPDATE:
        case BLE_GAP_EVT_AUTH_STATUS: {
            BleObject::getInstance().dispatcher()->enqueue(event);
            break;
        }
        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
                LOG_DEBUG(ERROR, "BLE GAP event: Connection timeout");
                if (connMgr->isConnecting_) {
                    connMgr->isConnecting_ = false;
                    os_semaphore_give(connMgr->connectSemaphore_, false);
                }
            }
            break;
        }
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request: %d, desired: %d",
                    event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu, connMgr->desiredAttMtu_);
            int ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, connMgr->desiredAttMtu_);
            if (ret != NRF_SUCCESS) {
                LOG_DEBUG(TRACE, "sd_ble_gatts_exchange_mtu_reply() failed: %d", ret);
                break;
            }
            BleObject::getInstance().dispatcher()->enqueue(event);
            break;
        }
        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "BLE GAP event: exchange MTU response.");
            ble_evt_t* attMtuExchangeEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t));
            if (!attMtuExchangeEvent) {
                LOG(ERROR, "Allocate memory for BLE event failed.");
                SPARK_ASSERT(false);
                break;
            }
            memcpy(attMtuExchangeEvent, event, sizeof(ble_evt_t));
            BleObject::getInstance().dispatcher()->enqueue(&attMtuExchangeEvent);
            break;
        }
        default: {
            break;
        }
    }
}

struct GattServerImpl {
    BleObject::GattServer* instance;
};
static GattServerImpl gattsImpl;

int BleObject::GattServer::init() {
    if (os_semaphore_create(&hvxSemaphore_, 1, 0)) {
        hvxSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        return SYSTEM_ERROR_INTERNAL;
    }
    gattsImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGattServer, 1, processGattServerEvents, &gattsImpl);
    gattsInitialized_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattServer::addService(uint8_t type, const hal_ble_uuid_t* uuid, hal_ble_attr_handle_t* svcHandle) {
    ble_uuid_t svcUuid;
    CHECK_TRUE(uuid, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(svcHandle, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(services_.size() <= BLE_MAX_SVC_COUNT, SYSTEM_ERROR_LIMIT_EXCEEDED);
    CHECK(BleObject::toPlatformUUID(uuid, &svcUuid));
    int ret = sd_ble_gatts_service_add(type, &svcUuid, svcHandle);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    services_.append(*svcHandle);
    LOG_DEBUG(TRACE, "Service handle: %d.", *svcHandle);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattServer::addCharacteristic(const hal_ble_char_init_t* charInit, hal_ble_char_handles_t* charHandles) {
    CHECK_TRUE(charHandles, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(charInit, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(characteristics_.size() <= BLE_MAX_CHAR_COUNT, SYSTEM_ERROR_LIMIT_EXCEEDED);
    CHECK_TRUE(findService(charInit->service_handle), SYSTEM_ERROR_NOT_FOUND);
    ble_uuid_t charUuid = {};
    ble_gatts_char_md_t charMd = {};
    ble_gatts_attr_md_t valueAttrMd = {};
    ble_gatts_attr_md_t userDescAttrMd = {};
    ble_gatts_attr_md_t cccdAttrMd = {};
    ble_gatts_attr_t charValueAttr = {};
    ble_gatts_char_handles_t handles = {};
    charMd.char_props = {};
    charMd.char_props = toPlatformCharProps(charInit->properties);
    // User Description Descriptor attribute metadata
    if (charInit->description != nullptr) {
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&userDescAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&userDescAttrMd.write_perm);
        userDescAttrMd.vloc = BLE_GATTS_VLOC_STACK;
        userDescAttrMd.rd_auth = 0;
        userDescAttrMd.wr_auth = 0;
        userDescAttrMd.vlen = 0;
        charMd.p_char_user_desc = (const uint8_t *)charInit->description;
        charMd.char_user_desc_max_size = std::min((size_t)BLE_MAX_DESC_LEN, strlen(charInit->description));
        charMd.char_user_desc_size = std::min((size_t)BLE_MAX_DESC_LEN, strlen(charInit->description));
        charMd.p_user_desc_md = &userDescAttrMd;
    } else {
        charMd.p_char_user_desc = nullptr;
        charMd.p_user_desc_md = nullptr;
    }
    // Client Characteristic Configuration Descriptor attribute metadata
    if (charMd.char_props.notify || charMd.char_props.indicate) {
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdAttrMd.write_perm);
        cccdAttrMd.vloc = BLE_GATTS_VLOC_STACK;
        charMd.p_cccd_md = &cccdAttrMd;
    }
    // TODO:
    charMd.p_char_pf = nullptr;
    charMd.p_sccd_md = nullptr;
    // Characteristic value attribute metadata
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&valueAttrMd.write_perm);
    valueAttrMd.vloc = BLE_GATTS_VLOC_USER;
    valueAttrMd.rd_auth = 0;
    valueAttrMd.wr_auth = 0;
    valueAttrMd.vlen = 1;
    // Characteristic value attribute
    CHECK(BleObject::toPlatformUUID(&charInit->uuid, &charUuid));
    uint8_t* charValue = (uint8_t*)malloc(BLE_MAX_ATTR_VALUE_PACKET_SIZE);
    CHECK_TRUE(charValue, SYSTEM_ERROR_NO_MEMORY);
    charValueAttr.p_uuid = &charUuid;
    charValueAttr.p_attr_md = &valueAttrMd;
    charValueAttr.init_len = 0;
    charValueAttr.init_offs = 0;
    charValueAttr.max_len = BLE_MAX_ATTR_VALUE_PACKET_SIZE;
    charValueAttr.p_value = charValue;
    int ret = sd_ble_gatts_characteristic_add(charInit->service_handle, &charMd, &charValueAttr, &handles);
    if (ret != NRF_SUCCESS) {
        free(charValue);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    }
    BleCharacteristic characteristic = {};
    characteristic.properties = charInit->properties;
    characteristic.svcHandle = charInit->service_handle;
    characteristic.charHandles.size = sizeof(hal_ble_char_handles_t);
    characteristic.charHandles.decl_handle = handles.value_handle - 1;
    characteristic.charHandles.value_handle = handles.value_handle;
    characteristic.charHandles.user_desc_handle = handles.user_desc_handle;
    characteristic.charHandles.cccd_handle = handles.cccd_handle;
    characteristic.charHandles.sccd_handle = handles.sccd_handle;
    characteristic.callback = charInit->callback;
    characteristic.context = charInit->context;
    CHECK_TRUE(characteristics_.append(characteristic), SYSTEM_ERROR_NO_MEMORY);
    *charHandles = characteristic.charHandles;
    LOG_DEBUG(TRACE, "Characteristic value handle: %d.", handles.value_handle);
    LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", handles.cccd_handle);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattServer::addDescriptor(hal_ble_attr_handle_t charHandle, const hal_ble_uuid_t* uuid, uint8_t* descriptor, size_t len, hal_ble_attr_handle_t* descHandle) {
    CHECK_TRUE(uuid, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(descriptor, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(descHandle, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(findCharacteristic(charHandle), SYSTEM_ERROR_NOT_FOUND);
    ble_gatts_attr_t descAttr = {};
    ble_gatts_attr_md_t descAttrMd = {};
    ble_uuid_t descUuid = {};
    CHECK(BleObject::toPlatformUUID(uuid, &descUuid));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&descAttrMd.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&descAttrMd.write_perm);
    descAttrMd.vloc = BLE_GATTS_VLOC_STACK;
    descAttrMd.rd_auth = 0;
    descAttrMd.wr_auth = 0;
    descAttrMd.vlen    = 0;
    descAttr.p_uuid    = &descUuid;
    descAttr.p_attr_md = &descAttrMd;
    descAttr.init_len  = len;
    descAttr.init_offs = 0;
    descAttr.max_len   = len;
    descAttr.p_value   = descriptor;
    // FIXME: validate the descriptor to be added
    int ret = sd_ble_gatts_descriptor_add(charHandle, &descAttr, descHandle);
    // TODO: assigne the handle to corresponding characteristic.
    return nrf_system_error(ret);
}

ssize_t BleObject::GattServer::setValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len) {
    CHECK_TRUE(attrHandle, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    CHECK_TRUE(characteristic, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(attrHandle == characteristic->charHandles.value_handle, SYSTEM_ERROR_NOT_FOUND);
    len = std::min(len, (size_t)BLE_MAX_ATTR_VALUE_PACKET_SIZE);
    ble_gatts_value_t gattValue = {};
    gattValue.len = len;
    gattValue.offset = 0;
    gattValue.p_value = (uint8_t*)buf;
    int ret = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, attrHandle, &gattValue);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    return len;
}

ssize_t BleObject::GattServer::notifyValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool ack) {
    CHECK_TRUE(attrHandle, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    CHECK_TRUE(characteristic, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE((characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY) || (characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE), SYSTEM_ERROR_NOT_SUPPORTED);
    for (const auto& subscriber : characteristic->subscribers) {
        if (subscriber.connHandle == BLE_INVALID_CONN_HANDLE) {
            continue;
        }
        ble_gatts_hvx_params_t hvxParams = {};
        uint16_t hvxLen = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(subscriber.connHandle)));
        if (ack && (subscriber.config & BLE_SIG_CCCD_VAL_INDICATION)) {
            hvxParams.type = BLE_GATT_HVX_INDICATION;
        } else if (!ack && (subscriber.config & BLE_SIG_CCCD_VAL_NOTIFICATION)) {
            hvxParams.type = BLE_GATT_HVX_NOTIFICATION;
        } else {
            continue;
        }
        hvxParams.handle = attrHandle;
        hvxParams.offset = 0;
        hvxParams.p_data = buf;
        hvxParams.p_len = &hvxLen;
        int ret = sd_ble_gatts_hvx(subscriber.connHandle, &hvxParams);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
            continue;
        }
        isHvxing_ = true;
        currHvxConnHandle_ = subscriber.connHandle;
        if (os_semaphore_take(hvxSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
            SPARK_ASSERT(false);
            break;
        }
        isHvxing_ = false;
        currHvxConnHandle_ = BLE_INVALID_CONN_HANDLE;
    }
    // FIXME: Different link may have different ATT_MTU, let's just return the possible maximum transmitted data length.
    return std::min(len, (size_t)BLE_MAX_ATTR_VALUE_PACKET_SIZE);
}

ssize_t BleObject::GattServer::getValue(hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len) {
    CHECK_TRUE(attrHandle, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    BleCharacteristic* characteristic = findCharacteristic(attrHandle);
    CHECK_TRUE(characteristic, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(attrHandle == characteristic->charHandles.value_handle, SYSTEM_ERROR_NOT_FOUND);
    len = std::min(len, (size_t)BLE_MAX_ATTR_VALUE_PACKET_SIZE);
    ble_gatts_value_t gattValue;
    gattValue.len = len;
    gattValue.offset = 0;
    gattValue.p_value = buf;
    int ret = sd_ble_gatts_value_get(BLE_CONN_HANDLE_INVALID, attrHandle, &gattValue);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    return gattValue.len;
}

bool BleObject::GattServer::findService(hal_ble_attr_handle_t svcHandle) const {
    for (const auto& handle : services_) {
        if (handle == svcHandle) {
            return true;
        }
    }
    return false;
}

BleObject::GattServer::BleCharacteristic* BleObject::GattServer::findCharacteristic(hal_ble_attr_handle_t attrHandle) {
    for (auto& characteristic : characteristics_) {
        if (characteristic.charHandles.value_handle == attrHandle ||
                characteristic.charHandles.decl_handle == attrHandle ||
                characteristic.charHandles.user_desc_handle == attrHandle ||
                characteristic.charHandles.cccd_handle == attrHandle ||
                characteristic.charHandles.sccd_handle == attrHandle) {
            return &characteristic;
        }
    }
    return nullptr;
}

int BleObject::GattServer::addSubscriber(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle, ble_sig_cccd_value_t value) {
    for (auto& subscriber : characteristic->subscribers) {
        if (subscriber.connHandle == connHandle) {
            subscriber.config = value;
            return SYSTEM_ERROR_NONE;
        }
    }
    Subscriber subscriber = {};
    subscriber.connHandle = connHandle;
    subscriber.config = value;
    CHECK_TRUE(characteristic->subscribers.append(subscriber), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleObject::GattServer::removeSubscriber(BleCharacteristic* characteristic, hal_ble_conn_handle_t connHandle) {
    size_t i = 0;
    for (auto& subscriber : characteristic->subscribers) {
        if (subscriber.connHandle == connHandle) {
            characteristic->subscribers.removeAt(i);
            return;
        }
        i++;
    }
}

void BleObject::GattServer::removeSubscriberFromAllCharacteristics(hal_ble_conn_handle_t connHandle) {
    for (auto& characteristic : characteristics_) {
        removeSubscriber(&characteristic, connHandle);
    }
}

int BleObject::GattServer::processDataWrittenEventFromThread(ble_evt_t* event) {
    ble_gatts_evt_write_t& write = event->evt.gatts_evt.params.write;
    BleCharacteristic* characteristic = findCharacteristic(write.handle);
    if (!characteristic) {
        // Writing to the GAP characteristics shouldn't log error.
        return SYSTEM_ERROR_NOT_FOUND;
    }
    hal_ble_char_evt_t charEvent = {};
    charEvent.conn_handle = event->evt.gatts_evt.conn_handle;
    charEvent.attr_handle = write.handle;
    if (characteristic->charHandles.cccd_handle == write.handle && write.len == sizeof(uint16_t)) {
        uint16_t cccd = ((uint16_t)write.data[1] << 8 | (uint16_t)write.data[0]) & BLE_SIG_CCCD_VAL_NOTI_IND;
        if (!(characteristic->properties & BLE_SIG_CHAR_PROP_NOTIFY)) {
            cccd &= ~BLE_SIG_CCCD_VAL_NOTIFICATION;
        }
        if (!(characteristic->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
            cccd &= ~BLE_SIG_CCCD_VAL_INDICATION;
        }
        if (cccd > 0) {
            CHECK(addSubscriber(characteristic, event->evt.gatts_evt.conn_handle, (ble_sig_cccd_value_t)cccd));
        } else {
            removeSubscriber(characteristic, event->evt.gatts_evt.conn_handle);
        }
        charEvent.type = BLE_EVT_CHAR_CCCD_UPDATED;
        charEvent.params.cccd_config.value = (ble_sig_cccd_value_t)cccd;
    } else if (characteristic->charHandles.value_handle == write.handle) {
        charEvent.type = BLE_EVT_DATA_WRITTEN;
        charEvent.params.data_written.offset = write.offset;
        charEvent.params.data_written.len = write.len;
        charEvent.params.data_written.data = write.data;
    } else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    if (characteristic->callback) {
        characteristic->callback(&charEvent, characteristic->context);
    }
    return SYSTEM_ERROR_NONE;
}

void BleObject::GattServer::processGattServerEvents(const ble_evt_t* event, void* context) {
    GattServer* gatts = static_cast<GattServerImpl*>(context)->instance;
    switch (event->header.evt_id) {
        case BLE_GAP_EVT_DISCONNECTED: {
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gap_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
            break;
        }
        case BLE_GATTS_EVT_WRITE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: data written.");
            ble_evt_t* dataWrittenEvent = (ble_evt_t*)BleObject::getInstance().dispatcher()->allocEventData(sizeof(ble_evt_t) +
                    SUB1(event->evt.gatts_evt.params.write.len) * sizeof(uint8_t));
            if (!dataWrittenEvent) {
                LOG(ERROR, "Allocate memory for received data failed.");
                break;
            }
            memcpy(dataWrittenEvent, event, sizeof(ble_evt_t));
            ble_gatts_evt_write_t& dataWritten = dataWrittenEvent->evt.gatts_evt.params.write;
            memcpy(dataWritten.data, event->evt.gatts_evt.params.write.data, dataWritten.len);
            BleObject::getInstance().dispatcher()->enqueue(&dataWrittenEvent);
            break;
        }
        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gatts_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gatts_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);
            // Disconnect on GATT Server timeout event.
            int ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
            if (gatts->isHvxing_ && gatts->currHvxConnHandle_ == event->evt.gatts_evt.conn_handle) {
                gatts->isHvxing_ = false;
                os_semaphore_give(gatts->hvxSemaphore_, false);
            }
            break;
        }
        default: {
            break;
        }
    }
}

struct GattClientImpl {
    BleObject::GattClient* instance;
};
static GattClientImpl gattcImpl;

int BleObject::GattClient::init() {
    if (os_semaphore_create(&discoverySemaphore_, 1, 0)) {
        discoverySemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_semaphore_create(&readSemaphore_, 1, 0)) {
        readSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    if (os_semaphore_create(&writeSemaphore_, 1, 0)) {
        writeSemaphore_ = nullptr;
        LOG(ERROR, "os_semaphore_create() failed");
        goto error;
    }
    gattcImpl.instance = this;
    NRF_SDH_BLE_OBSERVER(bleGattClient, 1, processGattClientEvents, &gattcImpl);
    gattcInitialized_ = true;
    return SYSTEM_ERROR_NONE;
error:
    if(discoverySemaphore_) {
        os_semaphore_destroy(discoverySemaphore_);
        discoverySemaphore_ = nullptr;
    }
    if(readSemaphore_) {
        os_semaphore_destroy(readSemaphore_);
        readSemaphore_ = nullptr;
    }
    if(writeSemaphore_) {
        os_semaphore_destroy(writeSemaphore_);
        writeSemaphore_ = nullptr;
    }
    return SYSTEM_ERROR_INTERNAL;
}

