particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
bool BleObject::GattClient::discovering(hal_ble_conn_handle_t connHandle) const {
    // TODO: discovering service and characteristic on multi-links concurrently.
    return isDiscovering_;
}

int BleObject::GattClient::discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, hal_ble_on_disc_service_cb_t callback, void* context) {
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_FALSE(isDiscovering_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        resetDiscoveryState();
    });
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES;
    discSvcCallback_ = callback;
    discSvcContext_ = context;
    int ret;
    if (uuid == nullptr) {
        discoverAll_ = true;
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, nullptr);
    } else {
        ble_uuid_t svcUUID;
        BleObject::toPlatformUUID(uuid, &svcUUID);
        ret = sd_ble_gattc_primary_services_discover(connHandle, SERVICES_BASE_START_HANDLE, &svcUUID);
    }
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, hal_ble_on_disc_char_cb_t callback, void* context) {
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_FALSE(isDiscovering_, SYSTEM_ERROR_INVALID_STATE);
    SCOPE_GUARD ({
        resetDiscoveryState();
    });
    currDiscSvc_ = *service;
    currDiscConnHandle_ = connHandle;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    discCharCallback_ = callback;
    discCharContext_ = context;
    ble_gattc_handle_range_t handleRange = {};
    handleRange.start_handle = currDiscSvc_.start_handle;
    handleRange.end_handle = currDiscSvc_.end_handle;
    int ret = sd_ble_gattc_characteristics_discover(connHandle, &handleRange);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isDiscovering_ = true;
    if (os_semaphore_take(discoverySemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

ssize_t BleObject::GattClient::writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response) {
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        currWriteConnHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    ble_gattc_write_params_t writeParams = {};
    if (response) {
        writeParams.write_op = BLE_GATT_OP_WRITE_REQ;
    } else {
        writeParams.write_op = BLE_GATT_OP_WRITE_CMD;
    }
    len = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(connHandle)));
    writeParams.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;
    writeParams.handle = attrHandle;
    writeParams.offset = 0;
    writeParams.len = len;
    writeParams.p_value = buf;
    int ret = sd_ble_gattc_write(connHandle, &writeParams);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isWriting_ = true;
    currWriteConnHandle_ = connHandle;
    if (os_semaphore_take(writeSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return len;
}

// FIXME: Multi-link read
ssize_t BleObject::GattClient::readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len) {
    CHECK_TRUE(buf, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(len, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(connHandle), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        isReading_ = false;
        readBuf_ = nullptr;
        readAttrHandle_ = BLE_INVALID_ATTR_HANDLE;
        currReadConnHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    readAttrHandle_ = attrHandle;
    readBuf_ = buf;
    readLen_ = std::min(len, (size_t)BLE_ATTR_VALUE_PACKET_SIZE(BleObject::getInstance().connMgr()->getAttMtu(connHandle)));
    int ret = sd_ble_gattc_read(connHandle, attrHandle, 0);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    isReading_ = true;
    currReadConnHandle_ = connHandle;
    if (os_semaphore_take(readSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return readLen_;
}

void BleObject::GattClient::resetDiscoveryState() {
    discoverAll_ = false;
    isDiscovering_ = false;
    currDiscConnHandle_ = BLE_INVALID_CONN_HANDLE;
    currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_IDLE;
    discServices_.clear();
    discCharacteristics_.clear();
}

bool BleObject::GattClient::readServiceUUID128IfNeeded() const {
    for (const auto& service : discServices_) {
        if (service.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, service.start_handle, 0) == NRF_SUCCESS);
        }
    }
    return false;
}

bool BleObject::GattClient::readCharacteristicUUID128IfNeeded() const {
    for (const auto& characteristic : discCharacteristics_) {
        if (characteristic.uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
            return (sd_ble_gattc_read(currDiscConnHandle_, characteristic.charHandles.decl_handle, 0) == NRF_SUCCESS);
        }
    }
    return false;
}

hal_ble_svc_t* BleObject::GattClient::findDiscoveredService(hal_ble_attr_handle_t attrHandle) {
    for (auto& service : discServices_) {
        if (service.start_handle <= attrHandle && attrHandle <= service.end_handle) {
            return &service;
        }
    }
    return nullptr;
}

hal_ble_char_t* BleObject::GattClient::findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle) {
    hal_ble_char_t* foundChar = nullptr;
    hal_ble_attr_handle_t foundCharDeclHandle = BLE_INVALID_ATTR_HANDLE;
    for (auto& characteristic : discCharacteristics_) {
        // The attribute handles increase by sequence.
        if (attrHandle >= characteristic.charHandles.decl_handle) {
            if (characteristic.charHandles.decl_handle > foundCharDeclHandle) {
                foundChar = &characteristic;
                foundCharDeclHandle = characteristic.charHandles.decl_handle;
            }
        }
    }
    return foundChar;
}

int BleObject::GattClient::addPublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle, hal_ble_on_char_evt_cb_t callback, void* context) {
    for (auto& publisher : publishers_) {
        if (publisher.connHandle == connHandle && publisher.valueHandle == valueHandle) {
            publisher.callback = callback;
            publisher.context = context;
            return SYSTEM_ERROR_NONE;
        }
    }
    Publisher pub = {};
    pub.connHandle = connHandle;
    pub.valueHandle = valueHandle;
    pub.callback = callback;
    pub.context = context;
    CHECK_TRUE(publishers_.append(pub), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::removePublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle) {
    size_t i = 0;
    for (const auto& publisher : publishers_) {
        if (publisher.connHandle == connHandle && publisher.valueHandle == valueHandle) {
            publishers_.removeAt(i);
            return SYSTEM_ERROR_NONE;
        }
        i++;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::removeAllPublishersOfConnection(hal_ble_conn_handle_t connHandle) {
    for (int i = 0; i < publishers_.size(); i = i) {
        const auto& publisher = publishers_[i];
        if (publisher.connHandle == connHandle) {
            publishers_.removeAt(i);
            continue;
        }
        i++;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::configureRemoteCCCD(const hal_ble_cccd_config_t* config) {
    CHECK_TRUE(BleObject::getInstance().connMgr()->valid(config->conn_handle), SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(config->cccd_handle != BLE_INVALID_ATTR_HANDLE, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(config->value_handle != BLE_INVALID_ATTR_HANDLE, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(config->cccd_value <= BLE_SIG_CCCD_VAL_NOTI_IND, SYSTEM_ERROR_NOT_SUPPORTED);
    uint8_t buf[2] = {0x00, 0x00};
    buf[0] = config->cccd_value;
    CHECK(writeAttribute(config->conn_handle, config->cccd_handle, buf, sizeof(buf), true));
    if (config->cccd_value > BLE_SIG_CCCD_VAL_DISABLED && config->cccd_value <= BLE_SIG_CCCD_VAL_NOTI_IND) {
        CHECK(addPublisher(config->conn_handle, config->value_handle, config->callback, config->context));
    } else {
        CHECK(removePublisher(config->conn_handle, config->value_handle));
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::processSvcDiscEventFromThread(const ble_evt_t* event) {
    if (!isDiscovering_ || currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_SERVICES ||
            event->evt.gattc_evt.conn_handle != currDiscConnHandle_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (event->header.evt_id == BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP) {
        const ble_gattc_evt_prim_srvc_disc_rsp_t& primSvcDiscRsp = event->evt.gattc_evt.params.prim_srvc_disc_rsp;
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            for (uint8_t i = 0; i < primSvcDiscRsp.count; i++) {
                hal_ble_svc_t service = {};
                service.version = BLE_API_VERSION;
                service.size = sizeof(hal_ble_svc_t);
                service.start_handle = primSvcDiscRsp.services[i].handle_range.start_handle;
                service.end_handle = primSvcDiscRsp.services[i].handle_range.end_handle;
                BleObject::toHalUUID(&primSvcDiscRsp.services[i].uuid, &service.uuid);
                if (!discServices_.append(service)) {
                    LOG(ERROR, "Failed to append discovered service.");
                    // Falls down to continue or finalize the service discovery procedure.
                }
            }
            hal_ble_attr_handle_t currEndHandle = primSvcDiscRsp.services[primSvcDiscRsp.count - 1].handle_range.end_handle;
            if (discoverAll_ && currEndHandle < SERVICES_TOP_END_HANDLE) {
                // Continue discovering services.
                if (sd_ble_gattc_primary_services_discover(currDiscConnHandle_, currEndHandle + 1, nullptr) == NRF_SUCCESS) {
                    return SYSTEM_ERROR_NONE;
                }
                LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed");
            }
        }
    } else if (event->header.evt_id == BLE_GATTC_EVT_READ_RSP) {
        const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            hal_ble_svc_t* service = findDiscoveredService(readRsp.handle);
            if (service) {
                service->uuid.type = BLE_UUID_TYPE_128BIT;
                memcpy(service->uuid.uuid128, readRsp.data, BLE_SIG_UUID_128BIT_LEN);
            }
        }
    } else {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    // Iterate the discovered services to read 128-bits service UUID as needed.
    if (readServiceUUID128IfNeeded()) {
        return SYSTEM_ERROR_NONE;
    }
    // Service discovery procedure has completed.
    isDiscovering_ = false;
    if (discSvcCallback_) {
        hal_ble_svc_discovered_evt_t svcDiscEvent = {};
        svcDiscEvent.conn_handle = currDiscConnHandle_;
        svcDiscEvent.count = discServices_.size();
        svcDiscEvent.services = discServices_.data();
        discSvcCallback_(&svcDiscEvent, discSvcContext_);
    }
    os_semaphore_give(discoverySemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::processCharDiscEventFromThread(const ble_evt_t* event) {
    if (!isDiscovering_ || event->evt.gattc_evt.conn_handle != currDiscConnHandle_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS &&
            currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (currDiscProcedure_ == DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) {
        if (event->header.evt_id == BLE_GATTC_EVT_CHAR_DISC_RSP) {
            const ble_gattc_evt_char_disc_rsp_t& charDiscRsp = event->evt.gattc_evt.params.char_disc_rsp;
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                for (uint8_t i = 0; i < charDiscRsp.count; i++) {
                    hal_ble_char_t characteristic = {};
                    characteristic.version = BLE_API_VERSION;
                    characteristic.size = sizeof(hal_ble_char_t);
                    characteristic.char_ext_props = charDiscRsp.chars[i].char_ext_props;
                    characteristic.properties = toHalCharProps(charDiscRsp.chars[i].char_props);
                    characteristic.charHandles.version = BLE_API_VERSION;
                    characteristic.charHandles.size = sizeof(hal_ble_char_handles_t);
                    characteristic.charHandles.decl_handle = charDiscRsp.chars[i].handle_decl;
                    characteristic.charHandles.value_handle = charDiscRsp.chars[i].handle_value;
                    BleObject::toHalUUID(&charDiscRsp.chars[i].uuid, &characteristic.uuid);
                    if (!discCharacteristics_.append(characteristic)) {
                        LOG(ERROR, "Failed to append discovered characteristic.");
                        // Falls down to continue or finalize the characteristic discovery procedure.
                    }
                }
                hal_ble_attr_handle_t currEndHandle = charDiscRsp.chars[charDiscRsp.count - 1].handle_value;
                if (currEndHandle < currDiscSvc_.end_handle) {
                    // Continue discovering characteristics.
                    ble_gattc_handle_range_t handleRange = {};
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle = currDiscSvc_.end_handle;
                    if (sd_ble_gattc_characteristics_discover(currDiscConnHandle_, &handleRange) == NRF_SUCCESS) {
                        return SYSTEM_ERROR_NONE;
                    }
                    LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed");
                }
            }
        } else if (event->header.evt_id == BLE_GATTC_EVT_READ_RSP) {
            const ble_gattc_evt_read_rsp_t& readRsp = event->evt.gattc_evt.params.read_rsp;
            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                hal_ble_char_t* characteristic = findDiscoveredCharacteristic(readRsp.handle);
                if (characteristic) {
                    characteristic->uuid.type = BLE_UUID_TYPE_128BIT;
                    memcpy(characteristic->uuid.uuid128, &readRsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                }
            }
        } else {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        // Iterate the discovered services to read 128-bits service UUID as needed.
        if (readCharacteristicUUID128IfNeeded()) {
            return SYSTEM_ERROR_NONE;
        }
        // Start discovering descriptors.
        currDiscProcedure_ = DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
        ble_gattc_handle_range_t handleRange = {};
        handleRange.start_handle = currDiscSvc_.start_handle;
        handleRange.end_handle = currDiscSvc_.end_handle;
        if (sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange) == NRF_SUCCESS) {
            return SYSTEM_ERROR_NONE;
        }
        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed");
    } else {
        // Descriptors discovered.
        if (event->header.evt_id != BLE_GATTC_EVT_DESC_DISC_RSP) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        const ble_gattc_evt_desc_disc_rsp_t& descDiscRsp = event->evt.gattc_evt.params.desc_disc_rsp;
        if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
            for (uint8_t i = 0; i < descDiscRsp.count; i++) {
                // It will report all attributes, filter descriptors only.
                if (descDiscRsp.descs[i].uuid.type != BLE_UUID_TYPE_BLE) {
                    continue;
                }
                hal_ble_char_t* characteristic = findDiscoveredCharacteristic(descDiscRsp.descs[i].handle);
                if (characteristic) {
                    switch (descDiscRsp.descs[i].uuid.uuid) {
                        case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC: {
                            characteristic->charHandles.user_desc_handle = descDiscRsp.descs[i].handle;
                        } break;
                        case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC: {
                            characteristic->charHandles.cccd_handle = descDiscRsp.descs[i].handle;
                        } break;
                        case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC: {
                            characteristic->charHandles.sccd_handle = descDiscRsp.descs[i].handle;
                        } break;
                        case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                        case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                        case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT:
                        default: break;
                    }
                }
            }
            hal_ble_attr_handle_t currEndHandle = descDiscRsp.descs[descDiscRsp.count - 1].handle;
            if (currEndHandle < currDiscSvc_.end_handle) {
                // Continue discovering descriptors.
                ble_gattc_handle_range_t handleRange = {};
                handleRange.start_handle = currEndHandle + 1;
                handleRange.end_handle = currDiscSvc_.end_handle;
                if (sd_ble_gattc_descriptors_discover(currDiscConnHandle_, &handleRange) == NRF_SUCCESS) {
                    return SYSTEM_ERROR_NONE;
                }
                LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed");
            }
        }
    }
    // Characteristic discovery procedure has completed.
    isDiscovering_ = false;
    if (discCharCallback_) {
        hal_ble_char_discovered_evt_t charDiscEvent = {};
        charDiscEvent.conn_handle = currDiscConnHandle_;
        charDiscEvent.count = discCharacteristics_.size();
        charDiscEvent.characteristics = discCharacteristics_.data();
        discCharCallback_(&charDiscEvent, discCharContext_);
    }
    os_semaphore_give(discoverySemaphore_, false);
    return SYSTEM_ERROR_NONE;
}

int BleObject::GattClient::processDescDiscEventFromThread(const ble_evt_t* event) {
    if (!isDiscovering_ || currDiscProcedure_ != DiscoveryProcedure::BLE_DISCOVERY_PROCEDURE_DESCRIPTORS ||
            event->evt.gattc_evt.conn_handle != currDiscConnHandle_) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    return processCharDiscEventFromThread(event);
}

